{
"gitCommands": [
	














    {"id":"16", "gitCommand":"git stash", "info":"Spara tillfälliga ändringar för att återställa ren arbetskatalog. Används när du behöver tillfälligt spara arbete innan du byter branch eller gör andra ändringar."},      
    {"id":"17","gitCommand":"git stash pop","info":"Återställ senaste stash och ta bort den från listan. Används för att återställa tidigare tillfälligt sparade ändringar."},
    {"id":"18","gitCommand":"git remote -v","info":"Visa remote repon och deras URL:er. Används för att kontrollera vilka remote repon som är kopplade till ditt lokala repo."},
    {"id":"19","gitCommand":"git reset <file>","info":"Avstagear en specifik fil från staging. Används när du vill ta bort en fil från staging utan att förlora ändringarna."},
    {"id":"20","gitCommand":"git stash apply","info":"Applicera senaste stash utan att ta bort den. Används när du vill återställa ändringar men behålla stashen för att kunna använda den senare."},
    {"id":"21","gitCommand":"git rm <file>","info":"Ta bort fil från repot och stagea borttagningen. Används när du vill ta bort filer från både lokalt och indexet."},
    {"id":"22","gitCommand":"git tag <tagname>","info":"Skapa en tagg för att markera en specifik commit. Används när du vill markera en viktig version av projektet (t.ex. en release)."},
    {"id":"23","gitCommand":"git cherry-pick <commit>","info":"Applicera specifik commit till aktuell branch. Används när du vill ta en specifik commit från en annan branch och tillämpa den på den aktuella."},
    {"id":"24","gitCommand":"git rebase <branch>","info":"Flyttar commits så att de appliceras ovanpå den senaste committen i en annan branch. Används för att uppdatera din branch med ändringar från en annan branch utan att skapa en merge commit, vilket håller historiken ren och linjär."},
    {"id":"25","gitCommand":"git config --global user.name","info":"Ställ in globalt användarnamn för Git. Används för att ange ditt namn för att identifiera dina commits."}






























]}